app/controllers/submissions_controller.rb

  def index
    @submission = Submission.new
    @projects = Submission.find(:all, :conditions => { :kind => 'project'}, :order => 'created_at DESC')
---
SELECT * FROM "submissions" WHERE ("submissions"."kind" = 'project')

  def create
    params[:submission]['kind'] = (params['commit'] == 'I am working on ...' ? 'project' : 'interest')

    Submission.create!(params[:submission])
---
INSERT INTO "submissions" ("name", "kind", "created_at", "submission", "updated_at") VALUES('biscuits', 'interest', '2010-04-16 13:57:28', 'shit', '2010-04-16 13:57:28')